# Load airtable companies

In [31]:
import pandas as pd

airtable_companies = pd.read_csv('../data/airtable-raw-companies-2020-05-22.csv')

airtable_companies.head()

,Partner Name,Contacts,Gmail Contacts in full,HQ,Employees,Industry,Website
0,8th Light,"Jim Suchy,Becca Townsend","Ashley Bye, Dennis Moore","""Angel, London""",51-200,üíº Consultancy,https://8thlight.com
1,Accurx,"Louise Hughes,Jacob Haddad",NaN,"""Dalston, London""",11-50,‚öïÔ∏èHealth Tech,https://www.accurx.com/
2,Acuris Global,NaN,NaN,City of London,501-1000,üè¢ Infrastructure,https://www.acuris.com/
3,Ad Hoc Global Ltd,NaN,NaN,"""Covent Garden, London""",1-10,üñ• Agency,http://www.adhocglobal.com/
4,Airtable,NaN,"Alex Dytrych, David Peterson","""Old Street, London""",11-50,üì≤Online Platform,https://airtable.com

# Load extracted hubspot Companies

In [32]:
hubspot_companies = pd.read_csv('../data/companies-from-deals.csv')

hubspot_companies.head()

,Unnamed: 0,Associated Company ID,Associated Company,Industry,Deal Name,Deal Stage
0,0,1005828045,Big Radical Limited,Non Profit,Web Community Project,0
1,1,1006470667,psygro.co.za,NaN,Trudy Tanner - 8thlight.com contact,0
2,2,1006849789,Care Coordination Systems,Health Care,CCS Pathways -- Admin Modules and Web Educatio...,0
3,3,1011074056,KOS Services LLC,NaN,Erin Steinhardt - 8thlight.com contact,0
4,4,1013701003,Dan Bocik,NaN,Dan Bocik - 8thlight.com contact,0

# Find companies interception

In [33]:
airtable_companies = airtable_companies.rename(columns={"Partner Name": "Associated Company"})

airtable_companies["Associated Company"] = airtable_companies["Associated Company"]
hubspot_companies["Associated Company"] = hubspot_companies["Associated Company"]

common_companies = pd.merge(hubspot_companies, airtable_companies, how='inner', on=['Associated Company'])

common_companies['Associated Company'].head()

0                BBC
1     Makers Academy
2       Ticketmaster
3       Ticketmaster
4    Thomson Reuters
Name: Associated Company, dtype: object

In [34]:
airtable_companies.describe()

,Associated Company,Contacts,Gmail Contacts in full,HQ,Employees,Industry,Website
count,185,109,52,185,184,184,184
unique,185,109,52,62,8,29,184
top,Library of Things,James Adams,"Alex Hind, Dennis Kent",City of London,11-50,‚òÆÔ∏è Social Impact,atomlearning.co.uk
freq,1,1,1,25,67,23,1

In [37]:
df = airtable_companies

df = df[~df["Associated Company"].isin(["Ticketmaster", "BBC", "Thomson Reuters", "Makers Academy"])]
df.describe()

,Associated Company,Contacts,Gmail Contacts in full,HQ,Employees,Industry,Website
count,181,107,52,181,180,180,180
unique,181,107,52,61,8,29,180
top,Library of Things,James Adams,"Alex Hind, Dennis Kent",City of London,11-50,‚òÆÔ∏è Social Impact,atomlearning.co.uk
freq,1,1,1,25,66,23,1

# Save filtered

In [ ]:
df.to_csv('../data/airtable-unique-companies.csv')